package ru.bender.pokerstatistic.bankroll;

import org.springframework.stereotype.Service;

@Service
public class CheckBankrollService {

    /** todo:
     * джоба проверяющая корректность банкролла. Все записи по порядку. В будущем не существует записей.
     * Если что-то не корректно, то добавляется запись в БД. После это отображается на UI. На UI есть кнопка, которая
     * помечает запись неактивной.
     * Плюс соответствие типов записи и изменении суммы банкролла?
     * Не должно быть одинаковых дат.
     */


}
